# Lesson 4
## Pandas

### Series

In [72]:
import pandas as pd

S = pd.Series([1,2,3,4])

In [73]:
print(S)

0    1
1    2
2    3
3    4
dtype: int64

In [74]:
S.index = ["a","b","c","d"]

In [75]:
print(S)

a    1
b    2
c    3
d    4
dtype: int64

In [76]:
print(S.shape)
print(S.size)
print(S.ndim)

(4,)
4
1

In [77]:
print(S.index)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [78]:
print(S.values)

[1 2 3 4]

In [79]:
print(S.loc['a'])

1

Use `loc` to indicate that you want to use a labeled index

In [80]:
print(S.iloc[0])

1

Use `iloc` to indicate that you are using an numerical index. Note that 'a' and 0 reference the same value.

In [81]:
print(S.drop('a'))

b    2
c    3
d    4
dtype: int64

In [82]:
print(S)

a    1
b    2
c    3
d    4
dtype: int64

Note that `drop` did not modify the original.

### Dataframes

In [83]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

In [84]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [85]:
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('The data in shopping_carts is:\n', shopping_carts.values)
print()
print('The row index in shopping_carts is:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

The data in shopping_carts is:
 [[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]

The row index in shopping_carts is: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Bob', 'Alice'], dtype='object')

In [86]:
# We Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])

# We display bob_shopping_cart
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [87]:
# Only shows selected items
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])

# We display sel_shopping_cart
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [88]:
# We Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])

# We display alice_sel_shopping_cart
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

#### Alternate DataFrame Initialization

In [89]:

# We create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# We create a DataFrame and provide the row index
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])

# We display the DataFrame
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [90]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame 
store_items = pd.DataFrame(items2)

# We display the DataFrame
store_items.index = ['store 1', 'store 2']

In [91]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [92]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [93]:
store_items.loc[['store 1']]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [94]:
# Always put the column label first!!
store_items['bikes']['store 1']

20

In [95]:
store_items['shirts'] = [0,20]

In [96]:
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35       0
store 2     15     50.0      5       10      20

In [97]:
store_items['suits'] = store_items['shirts'] + store_items['pants']

In [98]:
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35       0     30
store 2     15     50.0      5       10      20     25

In [99]:
new_items = [{'bikes': 20, 'glasses': 10, 'pants': 50, 'watches': 5, 'shirts': 1, 'suits': 51} ]
new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bikes  glasses  pants  shirts  suits  watches
store 3     20       10     50       1     51        5

In [100]:
# store_items.drop(index=['store 3'])

store_items = store_items.append(new_store, sort=True)
store_items

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30       0     30       35
store 2     15     50.0      5      20     25       10
store 3     20     10.0     50       1     51        5

In [101]:
store_items.insert(5, 'shoes', [1, 2, 4])

In [102]:
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches
store 1     20      NaN     30       0     30      1       35
store 2     15     50.0      5      20     25      2       10
store 3     20     10.0     50       1     51      4        5

In [103]:
store_items = store_items.rename(columns={'bikes':'hats'})

In [104]:
store_items

         hats  glasses  pants  shirts  suits  shoes  watches
store 1    20      NaN     30       0     30      1       35
store 2    15     50.0      5      20     25      2       10
store 3    20     10.0     50       1     51      4        5

In [106]:
store_items = store_items.rename(index={'store 3':'Gucci'})

In [107]:
store_items

         hats  glasses  pants  shirts  suits  shoes  watches
store 1    20      NaN     30       0     30      1       35
store 2    15     50.0      5      20     25      2       10
Gucci      20     10.0     50       1     51      4        5

In [108]:
store_items = store_items.set_index('pants')

In [109]:
store_items

       hats  glasses  shirts  suits  shoes  watches
pants
30       20      NaN       0     30      1       35
5        15     50.0      20     25      2       10
50       20     10.0       1     51      4        5

Index now has a name, 'pants'. The values of pants are used as indices for the table. 'pants' is also taken out of the columns.

#### How to deal with NaN

In [110]:
x = store_items.isnull()
print(x)

        hats  glasses  shirts  suits  shoes  watches
pants
30     False     True   False  False  False    False
5      False    False   False  False  False    False
50     False    False   False  False  False    False

In [111]:
# Drops rows with NaN values
store_items.dropna(axis=0)

       hats  glasses  shirts  suits  shoes  watches
pants
5        15     50.0      20     25      2       10
50       20     10.0       1     51      4        5

In [113]:
# Drops columns with NaN values
store_items.dropna(axis=1)

       hats  shirts  suits  shoes  watches
pants
30       20       0     30      1       35
5        15      20     25      2       10
50       20       1     51      4        5

In [114]:
store_items.fillna(0)

       hats  glasses  shirts  suits  shoes  watches
pants
30       20      0.0       0     30      1       35
5        15     50.0      20     25      2       10
50       20     10.0       1     51      4        5

In [115]:
store_items.fillna(store_items.mean())

       hats  glasses  shirts  suits  shoes  watches
pants
30       20     30.0       0     30      1       35
5        15     50.0      20     25      2       10
50       20     10.0       1     51      4        5

This works because `mean()` returns a series. That series provides the values that are broadcast to the rest of the DataFrame.